Autodesk.Revit.DB.Architecture.StairsType.MiddleSupportType
The type of middle supports used in the stair.
invalidElementId if the stairs type has no middle support.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: %elemId$ is not a valid middle support type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs type has no middle support so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.RightLateralOffset
The offset for the right support from the edge of the run in a horizontal direction.
0 if the right support is not carrige(open).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The right support style is not carriage(open), so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.LeftLateralOffset
The offset for the left support from the edge of the run in a horizontal direction.
0 if the left support is not carrige(open).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The left support style is not carriage(open), so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.RightSideSupportType
The type of right support used in the stair.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: rightSideStringerTypeId is not a valid support type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The right support style is not carriage(open), so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.LeftSideSupportType
The type of left support used in the stair.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: leftSideStringerTypeId is not a valid support type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The left support style is not carriage(open), so this related data cannot be set.
Since:
2013